In [3]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

#왜 판다스만 임포드 하면 DataFrame이 따라오지 않을까 ?

In [6]:
df1 = DataFrame({'key' : ['b','b','a', 'c', 'a', 'a', 'b'], 'data1' : range(7)})
df2 = DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})

In [8]:

df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [9]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [10]:
# 이 두 테이블을 합치는 작업

In [168]:
pd.merge(df1, df2, how = 'outer')

    a   b   c
0   1 NaN   2
1 NaN   2   6
2   5 NaN  10
3 NaN   6  14
4   4   3 NaN
5 NaN   4 NaN
6   3   6 NaN
7   7   8 NaN

In [12]:
# 궁금한점  :  이상태에서 열을 재배치 하려면?

In [169]:
df3 = DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df4 = DataFrame({'rkey': ['a', 'b', 'd'],'data2': range(3)})

In [175]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey', how ='outer')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a
6      3    c    NaN  NaN
7    NaN  NaN      2    d

In [15]:
#'c' and 'd' values and associated data are missing 
# from the result. By default merge does an 'inner' join; 
# the keys in the result are the intersection.

# 디폴트로 교집합

In [171]:
df3

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [172]:
df4

   data2 rkey
0      0    a
1      1    b
2      2    d

In [18]:
# 'left' , 'right' , and 'outer' join 옵션이 있다
print pd.merge(df1, df2, how='outer')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0
6      3   c    NaN
7    NaN   d      2

In [19]:
print pd.merge(df1, df2, how='left')

   data1 key  data2
0      0   b      1
1      1   b      1
2      2   a      0
3      3   c    NaN
4      4   a      0
5      5   a      0
6      6   b      1

In [20]:
print pd.merge(df1, df2, how='right')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0
6    NaN   d      2

In [21]:
#  한개의 값 당 여러개의 key 가 여러개 일때

In [22]:
left = DataFrame({'key1': ['foo', 'foo', 'bar'], 'key2': ['one', 'two', 'one'], 'lval': [1, 2, 3]})

In [23]:
right = DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],'key2': ['one', 'one', 'one', 'two'],'rval': [4, 5, 6, 7]})

In [60]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [63]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [177]:
pd.merge(left, right, on=['key1', 'key2'], how = 'outer') 
#합집합

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  foo  two     2   NaN
3  bar  one     3     6
4  bar  two   NaN     7

In [25]:
pd.merge (left, right, on='key1')

#key2가 반복됨

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [26]:
# 자동으로 x 와 y 표시가 들어 가므로 

pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7


# Merging on Index

In [27]:
left1 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],'value': range(6)})

right1 = DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [65]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [66]:
right1

   group_val
a        3.5
b        7.0

In [178]:
pd.merge(left1, right1, left_on='key', right_index=True, how = 'outer')
#key는 left1을 사용하지만 right1 값이 있는 거만 merge 됨

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [179]:
#여기서  how=outer를 쓰게 되면 교집합이 아닌 합집합이 나옴 
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [30]:
lefth = DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],'key2': [2000, 2001, 2002, 2001, 2002],'data': np.arange(5.)})

In [36]:
righth = DataFrame(np.arange(12).reshape((6, 2)), index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'],[2001, 2000, 2000, 2000, 2001, 2002]],columns=['event1', 'event2'])

In [37]:
lefth

   data    key1  key2
0     0    Ohio  2000
1     1    Ohio  2001
2     2    Ohio  2002
3     3  Nevada  2001
4     4  Nevada  2002

In [38]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [181]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

   data    key1  key2  event1  event2
0     0    Ohio  2000       4       5
0     0    Ohio  2000       6       7
1     1    Ohio  2001       8       9
2     2    Ohio  2002      10      11
3     3  Nevada  2001       0       1

In [59]:
# left_on 또는 left_index를 꼭 적어야 함 
# 최대 행수를 left_on이 정하고 right 데이터에서 벨류가 없는 항 들을 뺀다

# left_on      Columns in left/right DataFrame to use as join keys
# right_on     
# left_index   Use row index in left/right as its join key (or keys, if a MultiIndex)
# right_index

In [54]:
left2 = DataFrame([[1., 2.], [3., 4.], [5., 6.]], index=['a', 'c', 'e'],columns=['Ohio', 'Nevada'])

In [55]:
right2 = DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],index=['b', 'c', 'd', 'e'], columns=['Missouri', 'Alabama'])

In [56]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [57]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [58]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
b   NaN     NaN         7        8
c     3       4         9       10
d   NaN     NaN        11       12
e     5       6        13       14

In [67]:
# 동일 하게  join 명력어도 사용 가능

In [182]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
c     3       4         9       10
e     5       6        13       14

In [183]:
right2.join(left2)

   Missouri  Alabama  Ohio  Nevada
b         7        8   NaN     NaN
c         9       10     3       4
d        11       12   NaN     NaN
e        13       14     5       6

In [70]:
# how = outer를 쓰지 않을경우 자동으로 how = left 가 적용됨

In [71]:
another = DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],index=['a', 'c', 'e', 'f'], columns=['New York', 'Oregon'])

In [72]:
another

   New York  Oregon
a         7       8
c         9      10
e        11      12
f        16      17

In [74]:
# [ ] 안에 여러 DataFrame 을 넣는 것 가능 

left2.join([right2, another] ,  how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2       NaN      NaN         7       8
b   NaN     NaN         7        8       NaN     NaN
c     3       4         9       10         9      10
d   NaN     NaN        11       12       NaN     NaN
e     5       6        13       14        11      12
f   NaN     NaN       NaN      NaN        16      17

# Concatenating Along an Axis (축을 따라 이어진)

In [75]:
# 또다른 종류의 데이터 머징 방법 
# 넘파이가 제공하는 concatenate

In [76]:
arr = np.arange(12).reshape((3, 4))

In [77]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [187]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [79]:
# axis = 1 은 x축

In [80]:
# pandas  에서도 같은 역할을 하는 concat 이 있음

In [81]:
s1 = Series([0, 1], index=['a', 'b'])
s2 = Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = Series([5, 6], index=['f', 'g'])

In [188]:
s2

c    2
d    3
e    4
dtype: int64

In [82]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [84]:
# concat은 default로 y축으로 결합 된다

In [85]:
# x 축으로 결합을 시도 해보면

In [190]:
 pd.concat([s1, s2, s3], axis=1)
# 디폴트로 join = 'inner'

    0   1   2
a   0 NaN NaN
b   1 NaN NaN
c NaN   2 NaN
d NaN   3 NaN
e NaN   4 NaN
f NaN NaN   5
g NaN NaN   6

In [88]:
pd.concat([s1, s2, s3], axis=1, join = 'inner')

# 겹치는 부분이 없으므로

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [199]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
# s1 이 두번 들어감

In [200]:
type(result)

pandas.core.series.Series

In [201]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [91]:
# unstack명력어로 축 변경 가능

In [92]:
result.unstack()

        a   b   f   g
one     0   1 NaN NaN
two     0   1 NaN NaN
three NaN NaN   5   6

In [94]:
test = pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])

In [95]:
test.unstack()

        a   b   c   d   e   f   g
one     0   1 NaN NaN NaN NaN NaN
two   NaN NaN   2   3   4 NaN NaN
three NaN NaN NaN NaN NaN   5   6

In [203]:
# 애초에 이런식으로 만드려면 
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three']).T

        a   b   c   d   e   f   g
one     0   1 NaN NaN NaN NaN NaN
two   NaN NaN   2   3   4 NaN NaN
three NaN NaN NaN NaN NaN   5   6

In [99]:
# y축 인덱스가 아무른 의미가 없는 경우

In [100]:
df1 = DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [101]:
df1

          a         b         c         d
0  2.121796  0.965050  1.096191  0.604761
1 -1.328470  0.007686 -0.766709 -0.375903
2 -1.995416  0.114728  1.725862 -1.254490

In [102]:
df2

          b         d         a
0  1.178949 -0.455731  0.358857
1  0.912317  0.157200 -0.554876

In [103]:
pd.concat([df1, df2], ignore_index=True)
#데이터가 그냥 밑으로 쭉 쌓임

          a         b         c         d
0  2.121796  0.965050  1.096191  0.604761
1 -1.328470  0.007686 -0.766709 -0.375903
2 -1.995416  0.114728  1.725862 -1.254490
3  0.358857  1.178949       NaN -0.455731
4 -0.554876  0.912317       NaN  0.157200

# Combining Data with Overlap

In [104]:
# merge 또는 concat을 사용하는 경우 이 외

In [106]:
df1 = DataFrame({'a': [1., np.nan, 5., np.nan],'b': [np.nan, 2., np.nan, 6.],'c': range(2, 18, 4)})

In [107]:
df2 = DataFrame({'a': [5., 4., np.nan, 3., 7.],'b': [np.nan, 3., 4., 6., 8.]})

In [110]:
df1

    a   b   c
0   1 NaN   2
1 NaN   2   6
2   5 NaN  10
3 NaN   6  14

In [111]:
df2

    a   b
0   5 NaN
1   4   3
2 NaN   4
3   3   6
4   7   8

In [112]:
df1.combine_first(df2)
# df1값을 기봅값으로 하되 값이없을 경우  df2 값 삽입

   a   b   c
0  1 NaN   2
1  4   2   6
2  5   4  10
3  3   6  14
4  7   8 NaN

# Reshaping and Pivoting

In [113]:
# stack = 열 --> 행 
# unstack = 행 -->

In [114]:
data = DataFrame(np.arange(6).reshape((2, 3)),index=pd.Index(['Ohio', 'Colorado'], name='state'),columns=pd.Index(['one', 'two', 'three'], name='number'))

In [115]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [116]:
result = data.stack()

In [117]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [118]:
result.unstack()
#빠꾸
# 디폴트로

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [119]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [120]:
result.unstack(1)
# 디폴트로 unstack(1)

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [122]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

# ----------------------------- 여기 까지 
# Data Transformation

In [123]:
# Removing Duplicates 겹치는 값 버리기

In [124]:
data = DataFrame({'k1': ['one'] * 3 + ['two'] * 4,'k2': [1, 1, 2, 3, 3, 4, 4]})

In [125]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [134]:
#일단 겹치는게 있는 지 체크 
# default로 k2에 겹치는게 있는지 체그 
# 'k1' 을 넣주면 k1 check 
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [135]:
data.drop_duplicates()
# 겹치는거 버리삼

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [136]:
data['v1'] = range(7)
# 간단한 방법으로 데이터 추가

In [137]:
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [138]:
data.drop_duplicates(['k1'])
# 다버림

    k1  k2  v1
0  one   1   0
3  two   3   3

In [140]:
data.drop_duplicates(['k1', 'k2'], take_last=True) 
# 1. k2 & k1 을 묶어서 봣을때 겹치는 값들만 제거
# 2, 겹치는 값들중 마지막거를 남김

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [141]:
#Transforming Data Using a Function or Mapping





data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami','corned beef', 'Bacon', 'pastrami', 'honey ham','nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [142]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [143]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [144]:
# mapping

In [145]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
# 데이터를 추가함과 동시에 매핑

In [146]:
data 
#연결고리

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [147]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [148]:
# 다른 방법 같은 결과

In [149]:



#Replacing Values
#

In [150]:
data = Series([1., -999., 2., -999., -1000., 3.])

In [151]:
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: float64

In [153]:
data.replace([-999, -1000], np.nan)

0     1
1   NaN
2     2
3   NaN
4   NaN
5     3
dtype: float64

In [154]:
#각가 다른 값으로 바꿔칠때

In [155]:
data.replace([-999, -1000], [np.nan, 0])

0     1
1   NaN
2     2
3   NaN
4     0
5     3
dtype: float64

In [156]:




# Renaming Axis Indexes 축 이름 바꾸기

In [157]:
data = DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])

In [158]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [159]:
# 행 또는 열 이름을 교채하고싶을때

In [160]:
data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

          one  two  peekaboo  four
Ohio        0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [161]:
# 덮어 쓰기를 하지는 않는다 
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [162]:
#덮어 쓰기를 하고 싶은 경우 
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'}, inplace=True)

In [163]:
data

          one  two  peekaboo  four
Ohio        0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11